Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_serial_flash/firmware/src/packs/ATSAMA5D29_DFP/component/i2sc.h
/*
 * Component description for I2SC
 *
 * Copyright (c) 2024 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2024-06-24T14:43:55Z */
#ifndef _SAMA5D2_I2SC_COMPONENT_H_
#define _SAMA5D2_I2SC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR I2SC                                         */
/* ************************************************************************** */

/* -------- I2SC_CR : (I2SC Offset: 0x00) ( /W 32) Control Register -------- */
#define I2SC_CR_RXEN_Pos                      _UINT32_(0)                                          /* (I2SC_CR) Receiver Enable Position */
#define I2SC_CR_RXEN_Msk                      (_UINT32_(0x1) << I2SC_CR_RXEN_Pos)                  /* (I2SC_CR) Receiver Enable Mask */
#define I2SC_CR_RXEN(value)                   (I2SC_CR_RXEN_Msk & (_UINT32_(value) << I2SC_CR_RXEN_Pos)) /* Assigment of value for RXEN in the I2SC_CR register */
#define I2SC_CR_RXDIS_Pos                     _UINT32_(1)                                          /* (I2SC_CR) Receiver Disable Position */
#define I2SC_CR_RXDIS_Msk                     (_UINT32_(0x1) << I2SC_CR_RXDIS_Pos)                 /* (I2SC_CR) Receiver Disable Mask */
#define I2SC_CR_RXDIS(value)                  (I2SC_CR_RXDIS_Msk & (_UINT32_(value) << I2SC_CR_RXDIS_Pos)) /* Assigment of value for RXDIS in the I2SC_CR register */
#define I2SC_CR_CKEN_Pos                      _UINT32_(2)                                          /* (I2SC_CR) Clocks Enable Position */
#define I2SC_CR_CKEN_Msk                      (_UINT32_(0x1) << I2SC_CR_CKEN_Pos)                  /* (I2SC_CR) Clocks Enable Mask */
#define I2SC_CR_CKEN(value)                   (I2SC_CR_CKEN_Msk & (_UINT32_(value) << I2SC_CR_CKEN_Pos)) /* Assigment of value for CKEN in the I2SC_CR register */
#define I2SC_CR_CKDIS_Pos                     _UINT32_(3)                                          /* (I2SC_CR) Clocks Disable Position */
#define I2SC_CR_CKDIS_Msk                     (_UINT32_(0x1) << I2SC_CR_CKDIS_Pos)                 /* (I2SC_CR) Clocks Disable Mask */
#define I2SC_CR_CKDIS(value)                  (I2SC_CR_CKDIS_Msk & (_UINT32_(value) << I2SC_CR_CKDIS_Pos)) /* Assigment of value for CKDIS in the I2SC_CR register */
#define I2SC_CR_TXEN_Pos                      _UINT32_(4)                                          /* (I2SC_CR) Transmitter Enable Position */
#define I2SC_CR_TXEN_Msk                      (_UINT32_(0x1) << I2SC_CR_TXEN_Pos)                  /* (I2SC_CR) Transmitter Enable Mask */
#define I2SC_CR_TXEN(value)                   (I2SC_CR_TXEN_Msk & (_UINT32_(value) << I2SC_CR_TXEN_Pos)) /* Assigment of value for TXEN in the I2SC_CR register */
#define I2SC_CR_TXDIS_Pos                     _UINT32_(5)                                          /* (I2SC_CR) Transmitter Disable Position */
#define I2SC_CR_TXDIS_Msk                     (_UINT32_(0x1) << I2SC_CR_TXDIS_Pos)                 /* (I2SC_CR) Transmitter Disable Mask */
#define I2SC_CR_TXDIS(value)                  (I2SC_CR_TXDIS_Msk & (_UINT32_(value) << I2SC_CR_TXDIS_Pos)) /* Assigment of value for TXDIS in the I2SC_CR register */
#define I2SC_CR_SWRST_Pos                     _UINT32_(7)                                          /* (I2SC_CR) Software Reset Position */
#define I2SC_CR_SWRST_Msk                     (_UINT32_(0x1) << I2SC_CR_SWRST_Pos)                 /* (I2SC_CR) Software Reset Mask */
#define I2SC_CR_SWRST(value)                  (I2SC_CR_SWRST_Msk & (_UINT32_(value) << I2SC_CR_SWRST_Pos)) /* Assigment of value for SWRST in the I2SC_CR register */
#define I2SC_CR_Msk                           _UINT32_(0x000000BF)                                 /* (I2SC_CR) Register Mask  */


/* -------- I2SC_MR : (I2SC Offset: 0x04) (R/W 32) Mode Register -------- */
#define I2SC_MR_MODE_Pos                      _UINT32_(0)                                          /* (I2SC_MR) Inter-IC Sound Controller Mode Position */
#define I2SC_MR_MODE_Msk                      (_UINT32_(0x1) << I2SC_MR_MODE_Pos)                  /* (I2SC_MR) Inter-IC Sound Controller Mode Mask */
#define I2SC_MR_MODE(value)                   (I2SC_MR_MODE_Msk & (_UINT32_(value) << I2SC_MR_MODE_Pos)) /* Assigment of value for MODE in the I2SC_MR register */
#define   I2SC_MR_MODE_SLAVE_Val              _UINT32_(0x0)                                        /* (I2SC_MR) I2SC_CK and I2SC_WS pin inputs used as bit clock and word select/frame synchronization.  */
#define   I2SC_MR_MODE_MASTER_Val             _UINT32_(0x1)                                        /* (I2SC_MR) Bit clock and word select/frame synchronization generated by I2SC from MCK and output to I2SC_CK and I2SC_WS pins. Peripheral clock or GCLK is output as master clock on I2SC_MCK if I2SC_MR.IMCKMODE is set.  */
#define I2SC_MR_MODE_SLAVE                    (I2SC_MR_MODE_SLAVE_Val << I2SC_MR_MODE_Pos)         /* (I2SC_MR) I2SC_CK and I2SC_WS pin inputs used as bit clock and word select/frame synchronization. Position  */
#define I2SC_MR_MODE_MASTER                   (I2SC_MR_MODE_MASTER_Val << I2SC_MR_MODE_Pos)        /* (I2SC_MR) Bit clock and word select/frame synchronization generated by I2SC from MCK and output to I2SC_CK and I2SC_WS pins. Peripheral clock or GCLK is output as master clock on I2SC_MCK if I2SC_MR.IMCKMODE is set. Position  */
#define I2SC_MR_DATALENGTH_Pos                _UINT32_(2)                                          /* (I2SC_MR) Data Word Length Position */
#define I2SC_MR_DATALENGTH_Msk                (_UINT32_(0x7) << I2SC_MR_DATALENGTH_Pos)            /* (I2SC_MR) Data Word Length Mask */
#define I2SC_MR_DATALENGTH(value)             (I2SC_MR_DATALENGTH_Msk & (_UINT32_(value) << I2SC_MR_DATALENGTH_Pos)) /* Assigment of value for DATALENGTH in the I2SC_MR register */
#define   I2SC_MR_DATALENGTH_32_BITS_Val      _UINT32_(0x0)                                        /* (I2SC_MR) Data length is set to 32 bits  */
#define   I2SC_MR_DATALENGTH_24_BITS_Val      _UINT32_(0x1)                                        /* (I2SC_MR) Data length is set to 24 bits  */
#define   I2SC_MR_DATALENGTH_20_BITS_Val      _UINT32_(0x2)                                        /* (I2SC_MR) Data length is set to 20 bits  */
#define   I2SC_MR_DATALENGTH_18_BITS_Val      _UINT32_(0x3)                                        /* (I2SC_MR) Data length is set to 18 bits  */
#define   I2SC_MR_DATALENGTH_16_BITS_Val      _UINT32_(0x4)                                        /* (I2SC_MR) Data length is set to 16 bits  */
#define   I2SC_MR_DATALENGTH_16_BITS_COMPACT_Val _UINT32_(0x5)                                        /* (I2SC_MR) Data length is set to 16-bit compact stereo. Left sample in bits 15:0 and right sample in bits 31:16 of same word.  */
#define   I2SC_MR_DATALENGTH_8_BITS_Val       _UINT32_(0x6)                                        /* (I2SC_MR) Data length is set to 8 bits  */
#define   I2SC_MR_DATALENGTH_8_BITS_COMPACT_Val _UINT32_(0x7)                                        /* (I2SC_MR) Data length is set to 8-bit compact stereo. Left sample in bits 7:0 and right sample in bits 15:8 of the same word.  */
#define I2SC_MR_DATALENGTH_32_BITS            (I2SC_MR_DATALENGTH_32_BITS_Val << I2SC_MR_DATALENGTH_Pos) /* (I2SC_MR) Data length is set to 32 bits Position  */
#define I2SC_MR_DATALENGTH_24_BITS            (I2SC_MR_DATALENGTH_24_BITS_Val << I2SC_MR_DATALENGTH_Pos) /* (I2SC_MR) Data length is set to 24 bits Position  */
#define I2SC_MR_DATALENGTH_20_BITS            (I2SC_MR_DATALENGTH_20_BITS_Val << I2SC_MR_DATALENGTH_Pos) /* (I2SC_MR) Data length is set to 20 bits Position  */
#define I2SC_MR_DATALENGTH_18_BITS            (I2SC_MR_DATALENGTH_18_BITS_Val << I2SC_MR_DATALENGTH_Pos) /* (I2SC_MR) Data length is set to 18 bits Position  */
#define I2SC_MR_DATALENGTH_16_BITS            (I2SC_MR_DATALENGTH_16_BITS_Val << I2SC_MR_DATALENGTH_Pos) /* (I2SC_MR) Data length is set to 16 bits Position  */
#define I2SC_MR_DATALENGTH_16_BITS_COMPACT    (I2SC_MR_DATALENGTH_16_BITS_COMPACT_Val << I2SC_MR_DATALENGTH_Pos) /* (I2SC_MR) Data length is set to 16-bit compact stereo. Left sample in bits 15:0 and right sample in bits 31:16 of same word. Position  */
#define I2SC_MR_DATALENGTH_8_BITS             (I2SC_MR_DATALENGTH_8_BITS_Val << I2SC_MR_DATALENGTH_Pos) /* (I2SC_MR) Data length is set to 8 bits Position  */
#define I2SC_MR_DATALENGTH_8_BITS_COMPACT     (I2SC_MR_DATALENGTH_8_BITS_COMPACT_Val << I2SC_MR_DATALENGTH_Pos) /* (I2SC_MR) Data length is set to 8-bit compact stereo. Left sample in bits 7:0 and right sample in bits 15:8 of the same word. Position  */
#define I2SC_MR_FORMAT_Pos                    _UINT32_(6)                                          /* (I2SC_MR) Data Format Position */
#define I2SC_MR_FORMAT_Msk                    (_UINT32_(0x3) << I2SC_MR_FORMAT_Pos)                /* (I2SC_MR) Data Format Mask */
#define I2SC_MR_FORMAT(value)                 (I2SC_MR_FORMAT_Msk & (_UINT32_(value) << I2SC_MR_FORMAT_Pos)) /* Assigment of value for FORMAT in the I2SC_MR register */
#define   I2SC_MR_FORMAT_I2S_Val              _UINT32_(0x0)                                        /* (I2SC_MR) I2S format, stereo with I2SC_WS low for left channel, and MSB of sample starting one I2SC_CK period after I2SC_WS edge  */
#define   I2SC_MR_FORMAT_LJ_Val               _UINT32_(0x1)                                        /* (I2SC_MR) Left-justified format, stereo with I2SC_WS high for left channel, and MSB of sample starting on I2SC_WS edge  */
#define I2SC_MR_FORMAT_I2S                    (I2SC_MR_FORMAT_I2S_Val << I2SC_MR_FORMAT_Pos)       /* (I2SC_MR) I2S format, stereo with I2SC_WS low for left channel, and MSB of sample starting one I2SC_CK period after I2SC_WS edge Position  */
#define I2SC_MR_FORMAT_LJ                     (I2SC_MR_FORMAT_LJ_Val << I2SC_MR_FORMAT_Pos)        /* (I2SC_MR) Left-justified format, stereo with I2SC_WS high for left channel, and MSB of sample starting on I2SC_WS edge Position  */
#define I2SC_MR_RXMONO_Pos                    _UINT32_(8)                                          /* (I2SC_MR) Receive Mono Position */
#define I2SC_MR_RXMONO_Msk                    (_UINT32_(0x1) << I2SC_MR_RXMONO_Pos)                /* (I2SC_MR) Receive Mono Mask */
#define I2SC_MR_RXMONO(value)                 (I2SC_MR_RXMONO_Msk & (_UINT32_(value) << I2SC_MR_RXMONO_Pos)) /* Assigment of value for RXMONO in the I2SC_MR register */
#define I2SC_MR_RXLOOP_Pos                    _UINT32_(10)                                         /* (I2SC_MR) Loopback Test Mode Position */
#define I2SC_MR_RXLOOP_Msk                    (_UINT32_(0x1) << I2SC_MR_RXLOOP_Pos)                /* (I2SC_MR) Loopback Test Mode Mask */
#define I2SC_MR_RXLOOP(value)                 (I2SC_MR_RXLOOP_Msk & (_UINT32_(value) << I2SC_MR_RXLOOP_Pos)) /* Assigment of value for RXLOOP in the I2SC_MR register */
#define I2SC_MR_TXMONO_Pos                    _UINT32_(12)                                         /* (I2SC_MR) Transmit Mono Position */
#define I2SC_MR_TXMONO_Msk                    (_UINT32_(0x1) << I2SC_MR_TXMONO_Pos)                /* (I2SC_MR) Transmit Mono Mask */
#define I2SC_MR_TXMONO(value)                 (I2SC_MR_TXMONO_Msk & (_UINT32_(value) << I2SC_MR_TXMONO_Pos)) /* Assigment of value for TXMONO in the I2SC_MR register */
#define I2SC_MR_TXSAME_Pos                    _UINT32_(14)                                         /* (I2SC_MR) Transmit Data when Underrun Position */
#define I2SC_MR_TXSAME_Msk                    (_UINT32_(0x1) << I2SC_MR_TXSAME_Pos)                /* (I2SC_MR) Transmit Data when Underrun Mask */
#define I2SC_MR_TXSAME(value)                 (I2SC_MR_TXSAME_Msk & (_UINT32_(value) << I2SC_MR_TXSAME_Pos)) /* Assigment of value for TXSAME in the I2SC_MR register */
#define I2SC_MR_IMCKDIV_Pos                   _UINT32_(16)                                         /* (I2SC_MR) Selected Clock to I2SC Master Clock Ratio Position */
#define I2SC_MR_IMCKDIV_Msk                   (_UINT32_(0x3F) << I2SC_MR_IMCKDIV_Pos)              /* (I2SC_MR) Selected Clock to I2SC Master Clock Ratio Mask */
#define I2SC_MR_IMCKDIV(value)                (I2SC_MR_IMCKDIV_Msk & (_UINT32_(value) << I2SC_MR_IMCKDIV_Pos)) /* Assigment of value for IMCKDIV in the I2SC_MR register */
#define I2SC_MR_IMCKFS_Pos                    _UINT32_(24)                                         /* (I2SC_MR) Master Clock to fs Ratio Position */
#define I2SC_MR_IMCKFS_Msk                    (_UINT32_(0x3F) << I2SC_MR_IMCKFS_Pos)               /* (I2SC_MR) Master Clock to fs Ratio Mask */
#define I2SC_MR_IMCKFS(value)                 (I2SC_MR_IMCKFS_Msk & (_UINT32_(value) << I2SC_MR_IMCKFS_Pos)) /* Assigment of value for IMCKFS in the I2SC_MR register */
#define   I2SC_MR_IMCKFS_M2SF32_Val           _UINT32_(0x0)                                        /* (I2SC_MR) Sample frequency ratio set to 32  */
#define   I2SC_MR_IMCKFS_M2SF64_Val           _UINT32_(0x1)                                        /* (I2SC_MR) Sample frequency ratio set to 64  */
#define   I2SC_MR_IMCKFS_M2SF96_Val           _UINT32_(0x2)                                        /* (I2SC_MR) Sample frequency ratio set to 96  */
#define   I2SC_MR_IMCKFS_M2SF128_Val          _UINT32_(0x3)                                        /* (I2SC_MR) Sample frequency ratio set to 128  */
#define   I2SC_MR_IMCKFS_M2SF192_Val          _UINT32_(0x5)                                        /* (I2SC_MR) Sample frequency ratio set to 192  */
#define   I2SC_MR_IMCKFS_M2SF256_Val          _UINT32_(0x7)                                        /* (I2SC_MR) Sample frequency ratio set to 256  */
#define   I2SC_MR_IMCKFS_M2SF384_Val          _UINT32_(0xB)                                        /* (I2SC_MR) Sample frequency ratio set to 384  */
#define   I2SC_MR_IMCKFS_M2SF512_Val          _UINT32_(0xF)                                        /* (I2SC_MR) Sample frequency ratio set to 512  */
#define   I2SC_MR_IMCKFS_M2SF768_Val          _UINT32_(0x17)                                       /* (I2SC_MR) Sample frequency ratio set to 768  */
#define   I2SC_MR_IMCKFS_M2SF1024_Val         _UINT32_(0x1F)                                       /* (I2SC_MR) Sample frequency ratio set to 1024  */
#define   I2SC_MR_IMCKFS_M2SF1536_Val         _UINT32_(0x2F)                                       /* (I2SC_MR) Sample frequency ratio set to 1536  */
#define   I2SC_MR_IMCKFS_M2SF2048_Val         _UINT32_(0x3F)                                       /* (I2SC_MR) Sample frequency ratio set to 2048  */
#define I2SC_MR_IMCKFS_M2SF32                 (I2SC_MR_IMCKFS_M2SF32_Val << I2SC_MR_IMCKFS_Pos)    /* (I2SC_MR) Sample frequency ratio set to 32 Position  */
#define I2SC_MR_IMCKFS_M2SF64                 (I2SC_MR_IMCKFS_M2SF64_Val << I2SC_MR_IMCKFS_Pos)    /* (I2SC_MR) Sample frequency ratio set to 64 Position  */
#define I2SC_MR_IMCKFS_M2SF96                 (I2SC_MR_IMCKFS_M2SF96_Val << I2SC_MR_IMCKFS_Pos)    /* (I2SC_MR) Sample frequency ratio set to 96 Position  */
#define I2SC_MR_IMCKFS_M2SF128                (I2SC_MR_IMCKFS_M2SF128_Val << I2SC_MR_IMCKFS_Pos)   /* (I2SC_MR) Sample frequency ratio set to 128 Position  */
#define I2SC_MR_IMCKFS_M2SF192                (I2SC_MR_IMCKFS_M2SF192_Val << I2SC_MR_IMCKFS_Pos)   /* (I2SC_MR) Sample frequency ratio set to 192 Position  */
#define I2SC_MR_IMCKFS_M2SF256                (I2SC_MR_IMCKFS_M2SF256_Val << I2SC_MR_IMCKFS_Pos)   /* (I2SC_MR) Sample frequency ratio set to 256 Position  */
#define I2SC_MR_IMCKFS_M2SF384                (I2SC_MR_IMCKFS_M2SF384_Val << I2SC_MR_IMCKFS_Pos)   /* (I2SC_MR) Sample frequency ratio set to 384 Position  */
#define I2SC_MR_IMCKFS_M2SF512                (I2SC_MR_IMCKFS_M2SF512_Val << I2SC_MR_IMCKFS_Pos)   /* (I2SC_MR) Sample frequency ratio set to 512 Position  */
#define I2SC_MR_IMCKFS_M2SF768                (I2SC_MR_IMCKFS_M2SF768_Val << I2SC_MR_IMCKFS_Pos)   /* (I2SC_MR) Sample frequency ratio set to 768 Position  */
#define I2SC_MR_IMCKFS_M2SF1024               (I2SC_MR_IMCKFS_M2SF1024_Val << I2SC_MR_IMCKFS_Pos)  /* (I2SC_MR) Sample frequency ratio set to 1024 Position  */
#define I2SC_MR_IMCKFS_M2SF1536               (I2SC_MR_IMCKFS_M2SF1536_Val << I2SC_MR_IMCKFS_Pos)  /* (I2SC_MR) Sample frequency ratio set to 1536 Position  */
#define I2SC_MR_IMCKFS_M2SF2048               (I2SC_MR_IMCKFS_M2SF2048_Val << I2SC_MR_IMCKFS_Pos)  /* (I2SC_MR) Sample frequency ratio set to 2048 Position  */
#define I2SC_MR_IMCKMODE_Pos                  _UINT32_(30)                                         /* (I2SC_MR) Master Clock Mode Position */
#define I2SC_MR_IMCKMODE_Msk                  (_UINT32_(0x1) << I2SC_MR_IMCKMODE_Pos)              /* (I2SC_MR) Master Clock Mode Mask */
#define I2SC_MR_IMCKMODE(value)               (I2SC_MR_IMCKMODE_Msk & (_UINT32_(value) << I2SC_MR_IMCKMODE_Pos)) /* Assigment of value for IMCKMODE in the I2SC_MR register */
#define I2SC_MR_IWS_Pos                       _UINT32_(31)                                         /* (I2SC_MR) I2SC_WS Slot Width Position */
#define I2SC_MR_IWS_Msk                       (_UINT32_(0x1) << I2SC_MR_IWS_Pos)                   /* (I2SC_MR) I2SC_WS Slot Width Mask */
#define I2SC_MR_IWS(value)                    (I2SC_MR_IWS_Msk & (_UINT32_(value) << I2SC_MR_IWS_Pos)) /* Assigment of value for IWS in the I2SC_MR register */
#define I2SC_MR_Msk                           _UINT32_(0xFF3F55DD)                                 /* (I2SC_MR) Register Mask  */


/* -------- I2SC_SR : (I2SC Offset: 0x08) ( R/ 32) Status Register -------- */
#define I2SC_SR_RXEN_Pos                      _UINT32_(0)                                          /* (I2SC_SR) Receiver Enabled Position */
#define I2SC_SR_RXEN_Msk                      (_UINT32_(0x1) << I2SC_SR_RXEN_Pos)                  /* (I2SC_SR) Receiver Enabled Mask */
#define I2SC_SR_RXEN(value)                   (I2SC_SR_RXEN_Msk & (_UINT32_(value) << I2SC_SR_RXEN_Pos)) /* Assigment of value for RXEN in the I2SC_SR register */
#define I2SC_SR_RXRDY_Pos                     _UINT32_(1)                                          /* (I2SC_SR) Receive Ready Position */
#define I2SC_SR_RXRDY_Msk                     (_UINT32_(0x1) << I2SC_SR_RXRDY_Pos)                 /* (I2SC_SR) Receive Ready Mask */
#define I2SC_SR_RXRDY(value)                  (I2SC_SR_RXRDY_Msk & (_UINT32_(value) << I2SC_SR_RXRDY_Pos)) /* Assigment of value for RXRDY in the I2SC_SR register */
#define I2SC_SR_RXOR_Pos                      _UINT32_(2)                                          /* (I2SC_SR) Receive Overrun Position */
#define I2SC_SR_RXOR_Msk                      (_UINT32_(0x1) << I2SC_SR_RXOR_Pos)                  /* (I2SC_SR) Receive Overrun Mask */
#define I2SC_SR_RXOR(value)                   (I2SC_SR_RXOR_Msk & (_UINT32_(value) << I2SC_SR_RXOR_Pos)) /* Assigment of value for RXOR in the I2SC_SR register */
#define I2SC_SR_TXEN_Pos                      _UINT32_(4)                                          /* (I2SC_SR) Transmitter Enabled Position */
#define I2SC_SR_TXEN_Msk                      (_UINT32_(0x1) << I2SC_SR_TXEN_Pos)                  /* (I2SC_SR) Transmitter Enabled Mask */
#define I2SC_SR_TXEN(value)                   (I2SC_SR_TXEN_Msk & (_UINT32_(value) << I2SC_SR_TXEN_Pos)) /* Assigment of value for TXEN in the I2SC_SR register */
#define I2SC_SR_TXRDY_Pos                     _UINT32_(5)                                          /* (I2SC_SR) Transmit Ready Position */
#define I2SC_SR_TXRDY_Msk                     (_UINT32_(0x1) << I2SC_SR_TXRDY_Pos)                 /* (I2SC_SR) Transmit Ready Mask */
#define I2SC_SR_TXRDY(value)                  (I2SC_SR_TXRDY_Msk & (_UINT32_(value) << I2SC_SR_TXRDY_Pos)) /* Assigment of value for TXRDY in the I2SC_SR register */
#define I2SC_SR_TXUR_Pos                      _UINT32_(6)                                          /* (I2SC_SR) Transmit Underrun Position */
#define I2SC_SR_TXUR_Msk                      (_UINT32_(0x1) << I2SC_SR_TXUR_Pos)                  /* (I2SC_SR) Transmit Underrun Mask */
#define I2SC_SR_TXUR(value)                   (I2SC_SR_TXUR_Msk & (_UINT32_(value) << I2SC_SR_TXUR_Pos)) /* Assigment of value for TXUR in the I2SC_SR register */
#define I2SC_SR_RXORCH_Pos                    _UINT32_(8)                                          /* (I2SC_SR) Receive Overrun Channel Position */
#define I2SC_SR_RXORCH_Msk                    (_UINT32_(0x3) << I2SC_SR_RXORCH_Pos)                /* (I2SC_SR) Receive Overrun Channel Mask */
#define I2SC_SR_RXORCH(value)                 (I2SC_SR_RXORCH_Msk & (_UINT32_(value) << I2SC_SR_RXORCH_Pos)) /* Assigment of value for RXORCH in the I2SC_SR register */
#define I2SC_SR_TXURCH_Pos                    _UINT32_(20)                                         /* (I2SC_SR) Transmit Underrun Channel Position */
#define I2SC_SR_TXURCH_Msk                    (_UINT32_(0x3) << I2SC_SR_TXURCH_Pos)                /* (I2SC_SR) Transmit Underrun Channel Mask */
#define I2SC_SR_TXURCH(value)                 (I2SC_SR_TXURCH_Msk & (_UINT32_(value) << I2SC_SR_TXURCH_Pos)) /* Assigment of value for TXURCH in the I2SC_SR register */
#define I2SC_SR_Msk                           _UINT32_(0x00300377)                                 /* (I2SC_SR) Register Mask  */


